import React from "react";
import style from "@/app/page.module.css";
import Comment from "@/app/components/comment/Comment";

const CommentContainer = () => {
  return (
    <div className={style.comments__card__wrapper}>
      <Comment
        text={
          "Сьогодні я завершив етап лікувння зубів та виправлення помилок (моїх та попереднього лікаря)" +
          " у стоматолога Сергія Прожейко, за що хочу сказати йому велике дякую! Слідів реставрації майже" +
          " не видно. Якісно швидко і недорого. А ще минулого тижня безболісно видаляв корінь. Попереду" +
          " видалення двох зубів мудрості, так що теж прийду саме сюди."
        }
        date={"07.10.22"}
        name={"Анатолій Пікуль"}
        nameAvatar={"А"}
      />
      <Comment
        text={`Нарешті я знайшла лікаря, якого вже ніколи не зміню! На прийомі мені чітко пояснили ,які в мне проблеми, де і чому.  Я отримала чіткий план лікування, ми погодили мої фінансові можливості з кроками ,які необхідно зробити. Сергій приємна людина, приходячи до нього на прийом, почуваєш сее дуже комфортно!`}
        date={"23.06.20"}
        name={"Ніна Гаєвська"}
        nameAvatar={"Н"}
      />
      <Comment
        text={`Відмінний сервіс, класне ставлення до клієнта, Сергій - справжній професіонал, не тільки якісно виконав свою роботу за допомогою сучасної техніки, а також грамотно проконсультував про молочні зубки моєї дитини. Злагоджено, зворушливо, швидко! Приємно спотерігати за такою професійною роботою!`}
        date={"16.03.22"}
        name={"Маргарита Башутіна"}
        nameAvatar={"М"}
      />
    </div>
  );
};

export default CommentContainer;
