import img1 from "../assets/services/Rectangle 26.png";
import img2 from "../assets/services/Rectangle 38.png";
import img3 from "../assets/services/Rectangle28.png";
import img4 from "../assets/services/Rectangle29.png";

const blogArr = [
  {
    title: "Консультація та діагностика ротової порожнини",
    img: img1,
    id: "1",
    tag: "Діагностика",
    blocks: [
      { type: "subtitle", value: "Як ми працюємо?" },
      {
        type: "paragraph",
        value:
          "В основі нашої роботи – ми завжди закладаємо індивідуальний підхід до кожного пацієнта. Перед лікуванням – ми завжди складаємо план та узгоджуємо його з пацієнтом.\n" +
          "\n" +
          "В клініці PROZHEIKO Dental Studio ми вважаємо, що комплексна діагностика є запорукою постановки правильного діагнозу та успішного стоматологічного лікування.\n" +
          "\n" +
          "1.Планування візиту \n" +
          "     Підберемо зручні для Вас дату та час візиту\n" +
          "2.Діагностика\n" +
          "     Виконаємо комплексну професійну діагностику. Складемо повний план лікування та необхідність в участі суміжних спеціалістів (ортодонт, імплантолог, тощо)\n" +
          "3.Лікування\n" +
          "     Якісне лікування досвідченими спеціалістами, та з використанням найкращих матеріалів виробництва США, ЄС та  \n" +
          "     Японії.\n" +
          "4.Підтримка та спостереження\n" +
          "     Після лікування у багатьох випадках про пацієнта “забувають”, але не у нас.В клініці PROZHEIKO Dental Studio на Вас       \n" +
          "     чекають приємні “бонуси” у вигляді гарантії на роботи і постійна підтримка з боку лікаря.\n",
      },
      {
        type: "subtitle",
        value:
          "Основні принципи лікування зубів у клініці Prozheiko Dental Studio",
      },
      {
        type: "list",
        value: [
          "Обов’язкове складання плану лікування з описом фінансових витрат",
          "Комплексне обстеження зубощелепної системи перед початком лікування",
          "Використання в роботі мікроскопа з 22-кратним збільшенням",
          "Якісні витратні матеріали та дороге обладнання",
          "Фото та відеозйомка вихідної ситуації та результату лікування",
          "Дотримання гарантійних зобов’язань перед клієнтами",
        ],
      },
    ],
  },
  {
    title: "Професійна гігієна порожнини рота",
    img: img2,
    id: "2",
    tag: "Діагностика",
    blocks: [
      { type: "subtitle", value: "Як ми працюємо?" },
      {
        type: "paragraph",
        value:
          "В основі нашої роботи – ми завжди закладаємо індивідуальний підхід до кожного пацієнта. Перед лікуванням – ми завжди складаємо план та узгоджуємо його з пацієнтом.\n" +
          "\n" +
          "В клініці PROZHEIKO Dental Studio ми вважаємо, що комплексна діагностика є запорукою постановки правильного діагнозу та успішного стоматологічного лікування.\n" +
          "\n" +
          "1.Планування візиту \n" +
          "     Підберемо зручні для Вас дату та час візиту\n" +
          "2.Діагностика\n" +
          "     Виконаємо комплексну професійну діагностику. Складемо повний план лікування та необхідність в участі суміжних спеціалістів (ортодонт, імплантолог, тощо)\n" +
          "3.Лікування\n" +
          "     Якісне лікування досвідченими спеціалістами, та з використанням найкращих матеріалів виробництва США, ЄС та  \n" +
          "     Японії.\n" +
          "4.Підтримка та спостереження\n" +
          "     Після лікування у багатьох випадках про пацієнта “забувають”, але не у нас.В клініці PROZHEIKO Dental Studio на Вас       \n" +
          "     чекають приємні “бонуси” у вигляді гарантії на роботи і постійна підтримка з боку лікаря.\n",
      },
      {
        type: "subtitle",
        value:
          "Основні принципи лікування зубів у клініці Prozheiko Dental Studio",
      },
      {
        type: "list",
        value: [
          "Обов’язкове складання плану лікування з описом фінансових витрат",
          "Комплексне обстеження зубощелепної системи перед початком лікування",
          "Використання в роботі мікроскопа з 22-кратним збільшенням",
          "Якісні витратні матеріали та дороге обладнання",
          "Фото та відеозйомка вихідної ситуації та результату лікування",
          "Дотримання гарантійних зобов’язань перед клієнтами",
        ],
      },
    ],
  },
  {
    title: "Онлайн-консультація",
    id: "3",
    img: img3,
    tag: "Ортодонтія",
    blocks: [
      { type: "subtitle", value: "Як ми працюємо?" },
      {
        type: "paragraph",
        value:
          "В основі нашої роботи – ми завжди закладаємо індивідуальний підхід до кожного пацієнта. Перед лікуванням – ми завжди складаємо план та узгоджуємо його з пацієнтом.\n" +
          "\n" +
          "В клініці PROZHEIKO Dental Studio ми вважаємо, що комплексна діагностика є запорукою постановки правильного діагнозу та успішного стоматологічного лікування.\n" +
          "\n" +
          "1.Планування візиту \n" +
          "     Підберемо зручні для Вас дату та час візиту\n" +
          "2.Діагностика\n" +
          "     Виконаємо комплексну професійну діагностику. Складемо повний план лікування та необхідність в участі суміжних спеціалістів (ортодонт, імплантолог, тощо)\n" +
          "3.Лікування\n" +
          "     Якісне лікування досвідченими спеціалістами, та з використанням найкращих матеріалів виробництва США, ЄС та  \n" +
          "     Японії.\n" +
          "4.Підтримка та спостереження\n" +
          "     Після лікування у багатьох випадках про пацієнта “забувають”, але не у нас.В клініці PROZHEIKO Dental Studio на Вас       \n" +
          "     чекають приємні “бонуси” у вигляді гарантії на роботи і постійна підтримка з боку лікаря.\n",
      },
      {
        type: "subtitle",
        value:
          "Основні принципи лікування зубів у клініці Prozheiko Dental Studio",
      },
      {
        type: "list",
        value: [
          "Обов’язкове складання плану лікування з описом фінансових витрат",
          "Комплексне обстеження зубощелепної системи перед початком лікування",
          "Використання в роботі мікроскопа з 22-кратним збільшенням",
          "Якісні витратні матеріали та дороге обладнання",
          "Фото та відеозйомка вихідної ситуації та результату лікування",
          "Дотримання гарантійних зобов’язань перед клієнтами",
        ],
      },
    ],
  },
  {
    title: "Сканування",
    id: "4",
    img: img4,
    tag: "Гігієна та відбілювання",
    blocks: [
      { type: "subtitle", value: "Як ми працюємо?" },
      {
        type: "paragraph",
        value:
          "В основі нашої роботи – ми завжди закладаємо індивідуальний підхід до кожного пацієнта. Перед лікуванням – ми завжди складаємо план та узгоджуємо його з пацієнтом.\n" +
          "\n" +
          "В клініці PROZHEIKO Dental Studio ми вважаємо, що комплексна діагностика є запорукою постановки правильного діагнозу та успішного стоматологічного лікування.\n" +
          "\n" +
          "1.Планування візиту \n" +
          "     Підберемо зручні для Вас дату та час візиту\n" +
          "2.Діагностика\n" +
          "     Виконаємо комплексну професійну діагностику. Складемо повний план лікування та необхідність в участі суміжних спеціалістів (ортодонт, імплантолог, тощо)\n" +
          "3.Лікування\n" +
          "     Якісне лікування досвідченими спеціалістами, та з використанням найкращих матеріалів виробництва США, ЄС та  \n" +
          "     Японії.\n" +
          "4.Підтримка та спостереження\n" +
          "     Після лікування у багатьох випадках про пацієнта “забувають”, але не у нас.В клініці PROZHEIKO Dental Studio на Вас       \n" +
          "     чекають приємні “бонуси” у вигляді гарантії на роботи і постійна підтримка з боку лікаря.\n",
      },
      {
        type: "subtitle",
        value:
          "Основні принципи лікування зубів у клініці Prozheiko Dental Studio",
      },
      {
        type: "list",
        value: [
          "Обов’язкове складання плану лікування з описом фінансових витрат",
          "Комплексне обстеження зубощелепної системи перед початком лікування",
          "Використання в роботі мікроскопа з 22-кратним збільшенням",
          "Якісні витратні матеріали та дороге обладнання",
          "Фото та відеозйомка вихідної ситуації та результату лікування",
          "Дотримання гарантійних зобов’язань перед клієнтами",
        ],
      },
    ],
  },
];

export default blogArr;
