import img1 from "../assets/services/Rectangle 26.png";
import img3 from "../assets/services/Rectangle28.png";
import img4 from "../assets/services/Rectangle29.png";
// import img9 from "../assets/services/Rectangle 269.png";

const serviceArr = [
  {
    title: "Консультація та діагностика ротової порожнини",
    img: img1,
    id: "1",
    tag: "Діагностика",
    price: "500₴",
    text: "Професійна гігієна порожнини рота – це комплекс заходів, що спрямований на зняття зубних відкладень (зубного каменю і нальоту), полірування і ремінералізацію зубів. Це необхідна процедура, яка проводиться регулярно всім пацієнтам стоматологічної клініки.",
    list: [
      "Первинний огляд",
      "Вивчення результатів ортопантомограми та КТ",
      "Складання плану лікування",
      "Визначення переліку фахівців, що будуть задіяні",
    ],
    blocks: [
      { type: "subtitle", value: "Як ми працюємо?" },
      {
        type: "paragraph",
        value:
          "В основі нашої роботи – ми завжди закладаємо індивідуальний підхід до кожного пацієнта. Перед лікуванням – ми завжди складаємо план та узгоджуємо його з пацієнтом.\n" +
          "\n" +
          "В клініці PROZHEIKO Dental Studio ми вважаємо, що комплексна діагностика є запорукою постановки правильного діагнозу та успішного стоматологічного лікування.\n" +
          "\n" +
          "1.Планування візиту \n" +
          "     Підберемо зручні для Вас дату та час візиту\n" +
          "2.Діагностика\n" +
          "     Виконаємо комплексну професійну діагностику. Складемо повний план лікування та необхідність в участі суміжних спеціалістів (ортодонт, імплантолог, тощо)\n" +
          "3.Лікування\n" +
          "     Якісне лікування досвідченими спеціалістами, та з використанням найкращих матеріалів виробництва США, ЄС та  \n" +
          "     Японії.\n" +
          "4.Підтримка та спостереження\n" +
          "     Після лікування у багатьох випадках про пацієнта “забувають”, але не у нас.В клініці PROZHEIKO Dental Studio на Вас       \n" +
          "     чекають приємні “бонуси” у вигляді гарантії на роботи і постійна підтримка з боку лікаря.\n",
      },
      {
        type: "subtitle",
        value:
          "Основні принципи лікування зубів у клініці Prozheiko Dental Studio",
      },
      {
        type: "list",
        value: [
          "Обов’язкове складання плану лікування з описом фінансових витрат",
          "Комплексне обстеження зубощелепної системи перед початком лікування",
          "Використання в роботі мікроскопа з 22-кратним збільшенням",
          "Якісні витратні матеріали та дороге обладнання",
          "Фото та відеозйомка вихідної ситуації та результату лікування",
          "Дотримання гарантійних зобов’язань перед клієнтами",
        ],
      },
    ],
  },
  {
    title: "Сканування",
    img: img4,
    id: "2",
    tag: "Діагностика",
    price: "1400₴",
    text: "Цифрові технології впроваджуються в багато галузей медицини, в тому числі і в стоматологію. Все частіше в лікувальній практиці застосовується 3D візуалізація зубів , яка дає можливість лікарям в цифровому вигляді отримати тривимірну модель зубних рядів, щелеп та кісток черепа. 3D сканування дозволяє оглянути стоматологові навіть важкодоступні зони в ротовій порожнині.",
    blocks: [
      { type: "subtitle", value: "Як ми працюємо?" },
      {
        type: "paragraph",
        value:
          "В основі нашої роботи – ми завжди закладаємо індивідуальний підхід до кожного пацієнта. Перед лікуванням – ми завжди складаємо план та узгоджуємо його з пацієнтом.\n" +
          "\n" +
          "В клініці PROZHEIKO Dental Studio ми вважаємо, що комплексна діагностика є запорукою постановки правильного діагнозу та успішного стоматологічного лікування.\n" +
          "\n" +
          "Планування візиту \n" +
          "     Підберемо зручні для Вас дату та час візиту\n" +
          "Діагностика\n" +
          "     Виконаємо комплексну професійну діагностику. Складемо повний план лікування та необхідність в участі суміжних спеціалістів (ортодонт, імплантолог, тощо)\n" +
          "Лікування\n" +
          "Якісне лікування досвідченими спеціалістами, та з використанням найкращих матеріалів виробництва США, ЄС та  \n" +
          "Японії.\n" +
          "Підтримка та спостереження\n" +
          "Після лікування у багатьох випадках про пацієнта “забувають”, але не у нас.В клініці PROZHEIKO Dental Studio на Вас       \n" +
          "чекають приємні “бонуси” у вигляді гарантії на роботи і постійна підтримка з боку лікаря.\n" +
          "\n" +
          "Основні принципи лікування зубів у клініці Prozheiko Dental Studio\n" +
          "\n" +
          "Обов’язкове складання плану лікування з описом фінансових витрат\n" +
          "Комплексне обстеження зубощелепної системи перед початком лікування\n" +
          "Використання в роботі мікроскопа з 22-кратним збільшенням\n" +
          "Якісні витратні матеріали та дороге обладнання\n" +
          "Фото та відеозйомка вихідної ситуації та результату лікування\n" +
          "Дотримання гарантійних зобов’язань перед клієнтами",
      },
    ],
  },
  {
    title: "Онлайн-консультація",
    id: "3",
    img: img3,
    tag: "Діагностика",
    price: "500₴",
    text:
      "Якщо Ви вже маєте план лікування, отриманий в іншій клініці, один з наших фахівців ознайомиться з ним і дасть вам рекомендації на його основі в письмовому або телефонному вигляді, а також може внести в нього корективи. Адже завжди краще мати кілька поглядів на проблему, щоб вибрати найкращий з існуючих варіантів.\n" +
      "\n" +
      "Як проходить онлайн-консультація стоматолога:",
    list: [
      "Узгоджуємо дату та час консультації",
      "Ви відправляєте лікарю всю наявну інформацію та скарги",
      "За 10-15 хвилин підтверджуємо консультацію",
      "Тривалість консультації близько 15 хвилин",
      "Лікар зв’язується з Вами і проводить первинну консультацію",
      "Після консультації Ви можете запланувати візит в зручний для Вас час",
    ],
    blocks: [
      { type: "subtitle", value: "Як ми працюємо?" },
      {
        type: "paragraph",
        value:
          "В основі нашої роботи – ми завжди закладаємо індивідуальний підхід до кожного пацієнта. Перед лікуванням – ми завжди складаємо план та узгоджуємо його з пацієнтом.\n" +
          "\n" +
          "В клініці PROZHEIKO Dental Studio ми вважаємо, що комплексна діагностика є запорукою постановки правильного діагнозу та успішного стоматологічного лікування.\n" +
          "\n" +
          "Планування візиту \n" +
          "     Підберемо зручні для Вас дату та час візиту\n" +
          "Діагностика\n" +
          "     Виконаємо комплексну професійну діагностику. Складемо повний план лікування та необхідність в участі суміжних спеціалістів (ортодонт, імплантолог, тощо)\n" +
          "Лікування\n" +
          "     Якісне лікування досвідченими спеціалістами, та з використанням найкращих матеріалів виробництва США, ЄС та  \n" +
          "     Японії.\n" +
          "Підтримка та спостереження\n" +
          "     Після лікування у багатьох випадках про пацієнта “забувають”, але не у нас.В клініці PROZHEIKO Dental Studio на Вас       \n" +
          "     чекають приємні “бонуси” у вигляді гарантії на роботи і постійна підтримка з боку лікаря.\n" +
          "\n" +
          "Основні принципи лікування зубів у клініці Prozheiko Dental Studio\n" +
          "\n" +
          "Обов’язкове складання плану лікування з описом фінансових витрат\n" +
          "Комплексне обстеження зубощелепної системи перед початком лікування\n" +
          "Використання в роботі мікроскопа з 22-кратним збільшенням\n" +
          "Якісні витратні матеріали та дороге обладнання\n" +
          "Фото та відеозйомка вихідної ситуації та результату лікування\n" +
          "Дотримання гарантійних зобов’язань перед клієнтами",
      },
    ],
  },
  {
    title: "Професійна гігієна порожнини рота",
    id: "4",
    img: img1,
    tag: "Гігієна та відбілювання",
    price: "500₴",
    text: "Професійна гігієна порожнини рота – це комплекс заходів, що спрямований на зняття зубних відкладень (зубного каменю і нальоту), полірування і ремінералізацію зубів. Це необхідна процедура, яка проводиться регулярно всім пацієнтам стоматологічної клініки.",
    list: [
      "Зняття зубного каменю",
      "Зняття пігментованого зубного нальоту",
      "Зняття м’якого зубного нальоту",
      "Полірування зубної емалі після чистки",
    ],
    blocks: [
      { type: "subtitle", value: "Як ми працюємо?" },
      {
        type: "paragraph",
        value:
          "В основі нашої роботи – ми завжди закладаємо індивідуальний підхід до кожного пацієнта. Перед лікуванням – ми завжди складаємо план та узгоджуємо його з пацієнтом.\n" +
          "\n" +
          "В клініці PROZHEIKO Dental Studio ми вважаємо, що комплексна діагностика є запорукою постановки правильного діагнозу та успішного стоматологічного лікування.\n" +
          "\n" +
          "Планування візиту \n" +
          "     Підберемо зручні для Вас дату та час візиту\n" +
          "Діагностика\n" +
          "     Виконаємо комплексну професійну діагностику. Складемо повний план лікування та необхідність в участі суміжних спеціалістів (ортодонт, імплантолог, тощо)\n" +
          "Лікування\n" +
          "     Якісне лікування досвідченими спеціалістами, та з використанням найкращих матеріалів виробництва США, ЄС та  \n" +
          "     Японії.\n" +
          "Підтримка та спостереження\n" +
          "     Після лікування у багатьох випадках про пацієнта “забувають”, але не у нас.В клініці PROZHEIKO Dental Studio на Вас       \n" +
          "     чекають приємні “бонуси” у вигляді гарантії на роботи і постійна підтримка з боку лікаря.\n" +
          "\n" +
          "Основні принципи лікування зубів у клініці Prozheiko Dental Studio\n" +
          "\n" +
          "Обов’язкове складання плану лікування з описом фінансових витрат\n" +
          "Комплексне обстеження зубощелепної системи перед початком лікування\n" +
          "Використання в роботі мікроскопа з 22-кратним збільшенням\n" +
          "Якісні витратні матеріали та дороге обладнання\n" +
          "Фото та відеозйомка вихідної ситуації та результату лікування\n" +
          "Дотримання гарантійних зобов’язань перед клієнтами",
      },
    ],
  },
  // {
  //   title: "Брекет системи",
  //   id: "5",
  //   img: img9,
  //   tag: "Ортодонтія",
  //   price: "від 11500₴",
  //   text:
  //     "Вирівнювання зубів – одна з найактуальніший процедур у стоматології.\n" +
  //     "\n" +
  //     "Найпопулярнішим способом вирівнювання зубів є встановлення пацієнтам брекет-систем.\n" +
  //     "Необхідність застосування брекетів визначає стоматолог-ортодонт, а їх вартість залежить від вибраного типу, а також від індивідуальних особливостей зубощелепного відділу пацієнта.\n" +
  //     "\n" +
  //     "За матеріалами брекети діляться на:",
  //   list: [
  //     "Металева брекет-система",
  //     "Металева брекет-система самолігуюча",
  //     "Керамічна брекет-система",
  //     "Керамічна брекет-система самолігуюча",
  //   ],
  //   blocks: [
  //     { type: "subtitle", value: "Як ми працюємо?" },
  //     {
  //       type: "paragraph",
  //       value:
  //         "В основі нашої роботи – ми завжди закладаємо індивідуальний підхід до кожного пацієнта. Перед лікуванням – ми завжди складаємо план та узгоджуємо його з пацієнтом.\n" +
  //         "\n" +
  //         "В клініці PROZHEIKO Dental Studio ми вважаємо, що комплексна діагностика є запорукою постановки правильного діагнозу та успішного стоматологічного лікування.\n" +
  //         "\n" +
  //         "Планування візиту \n" +
  //         "     Підберемо зручні для Вас дату та час візиту\n" +
  //         "Діагностика\n" +
  //         "     Виконаємо комплексну професійну діагностику. Складемо повний план лікування та необхідність в участі суміжних спеціалістів (ортодонт, імплантолог, тощо)\n" +
  //         "Лікування\n" +
  //         "     Якісне лікування досвідченими спеціалістами, та з використанням найкращих матеріалів виробництва США, ЄС та  \n" +
  //         "     Японії.\n" +
  //         "Підтримка та спостереження\n" +
  //         "     Після лікування у багатьох випадках про пацієнта “забувають”, але не у нас.В клініці PROZHEIKO Dental Studio на Вас       \n" +
  //         "     чекають приємні “бонуси” у вигляді гарантії на роботи і постійна підтримка з боку лікаря.\n" +
  //         "\n" +
  //         "Основні принципи лікування зубів у клініці Prozheiko Dental Studio\n" +
  //         "\n" +
  //         "Обов’язкове складання плану лікування з описом фінансових витрат\n" +
  //         "Комплексне обстеження зубощелепної системи перед початком лікування\n" +
  //         "Використання в роботі мікроскопа з 22-кратним збільшенням\n" +
  //         "Якісні витратні матеріали та дороге обладнання\n" +
  //         "Фото та відеозйомка вихідної ситуації та результату лікування\n" +
  //         "Дотримання гарантійних зобов’язань перед клієнтами",
  //     },
  //   ],
  // },
];

export default serviceArr;
